tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "stripe/stripe-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Modern replacement for 'ls'
brew "exa"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10", link: false
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
# Apple TV Aerial screensaver
cask "aerial"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Multi-track audio editor and recorder
cask "audacity"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
# Menu bar icon organizer
cask "bartender"
# Free up disk space
cask "disk-diet"
# App to build and share containerized applications and microservices
cask "docker"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Downloads videos from different websites
cask "downie"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Productivity app
cask "dropzone"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Password manager
cask "lastpass"
# WordPress local development tool by Flywheel
cask "local"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# App to write, plan, collaborate, and get organized
cask "notion"
# Retro video game emulation
cask "openemu"
# Archive manager for data compression and backups
cask "rar"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# GUI for streamlined Redis application development
cask "redisinsight"
# Dreamcast emulator
cask "redream"
# PDF editor
cask "sejda-pdf"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# SSH client
cask "termius"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "ContactsMate", id: 1236603338
mas "DaVinci Resolve", id: 571213070
mas "feedly", id: 865500966
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Pixelmator Pro", id: 1289583905
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "VN", id: 1494451650
mas "Xcode", id: 497799835
