# Taps - repos
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Brews - packages
# https://formulae.brew.sh/formula/
brew "bat"
brew "bat-extras"
brew "exa"
brew "gcc"
brew "git"
brew "httpie"
brew "nvm"
brew "mas"
brew "wget"

#Casks - apps
# https://formulae.brew.sh/cask/
cask "alfred"
cask "aerial"
cask "docker"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "google-drive"
cask "lastpass"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "onedrive"
#cask "rectangle"
cask "slack"
#cask "spotify"
cask "sourcetree"
cask "sublime-text"
cask "teamviewer"
cask "termius"
#cask "visual-studio"
cask "visual-studio-code"
cask "vlc"

# app store
mas "Amphetamine", 937984704
mas "iMovie", 408981434
mas "Magnet", 441258766
mas "Shush", 496437906
mas "Snappy", 512617038
