tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Modern replacement for 'ls'
brew "exa"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Manage multiple Node.js versions
brew "nvm"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Apple TV Aerial screensaver
cask "aerial"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Multi-track audio editor and recorder
cask "audacity"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
cask "font-fira-code"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Password manager
cask "lastpass"
# WordPress local development tool by Flywheel
cask "local"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Text editor for code, markup and prose
cask "sublime-text"
# Remote access and connectivity software focused on security
cask "teamviewer"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Messenger", id: 1480068668
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
